Submitted on 5:49 08 Jan 2024 || Result: PASSED [PPPPPPPPPP] Explain results
ภาพวาดรูปแบบหนึ่งที่มักเห็นประจำในอินเดียก็คือ ภาพวาดที่เรียกว่า รังโกลี (Rangoli) ซึ่งเป็นรูปแบบหนึ่งของศิลปะที่นิยมมากที่สุดในอินเดียก็ว่าได้ เป็นการวาดภาพด้วยทรายหรือผงสี บนพื้นขาวหรือพื้นสี ซึ่งมักใช้ตกแต่งหน้าบ้านของชาวอินเดียในงานเทศกาลต่างๆ หรือในสถานที่จัดงานสำคัญๆ หมายถึงการต้อนรับขับสู้อย่างอบอุ่นของเจ้าบ้านหรือเจ้าภาพต่อแขกที่มาเยือน

ในข้อนี้จะให้เขียนโปรแกรมเพื่อวาดภาพรังโกลี จากตัวอักษรภาษาอังกฤษ โดยรับข้อมูลเป็นจำนวนเต็มบวก N (N <= 26) ซึ่งเป็นขนาดของภาพรังโกลี และเป็นลำดับอักษรภาษาอังกฤษสูงสุดที่ใช้ในภาพ เช่น N = 3 หมายถึงใช้ตัวอักษรภาษาอังกฤษ a, b และ c เท่านั้น

ขนาดของภาพรังโกลีมีลักษณะดังนี้

#Size N = 3
----c----
--c-b-c--
c-b-a-b-c
--c-b-c--
----c----

#Size N = 10
------------------j------------------
----------------j-i-j----------------
--------------j-i-h-i-j--------------
------------j-i-h-g-h-i-j------------
----------j-i-h-g-f-g-h-i-j----------
--------j-i-h-g-f-e-f-g-h-i-j--------
------j-i-h-g-f-e-d-e-f-g-h-i-j------
----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
--j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
j-i-h-g-f-e-d-c-b-a-b-c-d-e-f-g-h-i-j
--j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
------j-i-h-g-f-e-d-e-f-g-h-i-j------
--------j-i-h-g-f-e-f-g-h-i-j--------
----------j-i-h-g-f-g-h-i-j----------
------------j-i-h-g-h-i-j------------
--------------j-i-h-i-j--------------
----------------j-i-j----------------
------------------j------------------

จากภาพรังโกลีขนาด 10 จะเห็นว่า ตัวอักษรที่ใช้วาดตัวนอกสุดคือ j ซึ่งเป็นตัวอักษรตัวที่ 10 ในภาษาอังกฤษ ถัดมาข้างในเป็น i, h, g, f, e, d, c, b, และ a ตามลำดับ

หมายเหตุ

หากสร้างภาพรังโกลีไม่ได้ ให้พิมพ์ -
ตัวอย่างโปรแกรม 1

10
------------------j------------------
----------------j-i-j----------------
--------------j-i-h-i-j--------------
------------j-i-h-g-h-i-j------------
----------j-i-h-g-f-g-h-i-j----------
--------j-i-h-g-f-e-f-g-h-i-j--------
------j-i-h-g-f-e-d-e-f-g-h-i-j------
----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
--j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
j-i-h-g-f-e-d-c-b-a-b-c-d-e-f-g-h-i-j
--j-i-h-g-f-e-d-c-b-c-d-e-f-g-h-i-j--
----j-i-h-g-f-e-d-c-d-e-f-g-h-i-j----
------j-i-h-g-f-e-d-e-f-g-h-i-j------
--------j-i-h-g-f-e-f-g-h-i-j--------
----------j-i-h-g-f-g-h-i-j----------
------------j-i-h-g-h-i-j------------
--------------j-i-h-i-j--------------
----------------j-i-j----------------
------------------j------------------
ตัวอย่างโปรแกรม 2

0
-

[hide line #]
#include <stdio.h>
#include <stdlib.h>

void row(int size ,int n){
    int ch , i ,dash;
    ch = 96+n;
    dash = (n*2-1)-(size*2-1);

    for (i=1;i<=dash;i++){
        printf("-");
    }
    printf("%c",ch);
    ch -= 1;
    for (i=1;i<=size-1;i++){
        printf("-");
        printf("%c",ch);
        ch -= 1;
    }
    ch += 2;
    for (i=1;i<=size-1;i++){
        printf("-");
        printf("%c",ch);
        ch += 1;
    }
    for (i=1;i<=dash;i++){
        printf("-");
    }
    printf("\n");
}


int main(){
    char n_str[20] ;
    fgets(n_str, 20, stdin);
    int n , i ;
    n = atoi(n_str);

    if (n==0 || n>26 || n<0){
        printf("-");
    } else {
        for (i=1;i<=n;i++){
            row(i,n);
        }
        for (i=(n-1);i>=1;i--){
            row(i,n);
        }
    }

}
