Submitted on 21:49 13 Jan 2024 || Result: PASSED [PPPPPPPPPP] Explain results
เส้นทางแห่งนักบวช
หมากรุกสากลเป็นเกมส์ที่เล่นบนกระดานตารางขนาด 8x8 ช่อง โดยตัวนักบวช (Bishop) นั้นสามารถเดินเป็นเฉียงได้สี่ทิศทาง (ซ้ายบน ขวาบน ซ้ายล่าง ขวาล่าง) และระยะการเดินนั้นไม่จำกัด (ยกเว้นสุดขอบกระดาน) ให้นิสิตเขียนฟังก์ชัน bishopMoves() ซึ่งรับตำแหน่งของนักบวชมา แล้วกำหนดตำแหน่งที่นักบวชเดินไปได้ โดยกำหนดให้ช่องซ้ายบนสุดมีตำแหน่งเป็น 0 0 และช่องขวามือล่างสุดมีตำแหน่งเป็น 7 7

จากนั้นให้นิสิตพิมพ์ตารางหมากรุกโดยแสดงตำแหน่งของนักบวชด้วยอักษร B และแสดงตำแหน่งที่นักบวชเดินไปได้ด้วยอักษร X ถ้านักบวชเดินไปยังตำแหน่งนั้นไม่ได้ให้พิมพ์ช่องว่าง (space bar)

ตัวอย่างผลลัพธ์ที่ 1
Enter Bishop's X Y position: 3 4
  0 1 2 3 4 5 6 7
------------------
0| | | | | | | |X|
------------------
1|X| | | | | |X| |
------------------
2| |X| | | |X| | |
------------------
3| | |X| |X| | | |
------------------
4| | | |B| | | | |
------------------
5| | |X| |X| | | |
------------------
6| |X| | | |X| | |
------------------
7|X| | | | | |X| |
------------------

[hide line #]
#include <stdio.h>
#define BOARD_SIZE 8

void bishopMoves(
int board[][BOARD_SIZE], int xPos,int yPos
) {
  
    for(int i=0;i<BOARD_SIZE;i++){
        for(int j=0;j<BOARD_SIZE;j++){
            if (i==xPos &&j==yPos){
                board[i][j]='B';
            } else {
                for(int k=0;k<BOARD_SIZE;k++){
                    if (i== xPos-k &&j== yPos-k ){
                        board[i][j]='X';
                    } if (i== xPos+k &&j== yPos+k ){
                        board[i][j]='X';
                    } if (i== xPos+k &&j== yPos-k ){
                        board[i][j]='X';
                    } if (i== xPos-k &&j== yPos+k ){
                        board[i][j]='X';
                    }
            }
        }

    }

}

}

int main() {

  
   int xPos, yPos;

    int board[][BOARD_SIZE] = {
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
        {' ',' ',' ',' ',' ',' ',' ',' '},
    };

    printf("Enter Bishop's X Y position: ");
    scanf("%d %d",&xPos ,&yPos);

    bishopMoves(board,xPos,yPos);
    printf("  0 1 2 3 4 5 6 7\n");


    for(int i=0;i<BOARD_SIZE;i++){
        printf("------------------\n");
        printf("%d",i);
        for(int j=0;j<BOARD_SIZE;j++){
            printf("|%c",board[j][i]);
        }
        printf("|\n");
    }
    printf("------------------");
  


}
