ให้เขียนโปรแกรมภาษา C++ เพื่อคำนวณเงินได้รายปีของพนักงานขายสินค้าคนหนึ่ง
โดยมีบันทึกข้อมูลของเงินเดือน และมูลค่าสินค้าที่พนักงานขายได้ในแต่ละเดือน
ระหว่างปีนี้ ไม่มีการขึ้นเงินเดือน และพนักงานขายจะได้เงินได้เพิ่มขึ้นอีก 15% จากมูลค่าสินค้าที่ขายได้ในแต่ละเดือน

ข้อมูลเข้า
บรรทัดแรก เป็นชื่อของพนักงาน
บรรทัดที่สอง เป็นเงินเดือนของพนักงาน (ทศนิยม 2 ตำแหน่ง)
อีก 12 บรรทัดต่อมา เป็นมูลค่าสินค้าที่พนักงานขายได้ในแต่ละเดือนใน 1 ปี
ข้อมูลออก
บรรทัดเดียว แสดงชื่อของพนักงาน และรายได้ทั้งปีของพนักงาน (ทศนิยม 2 ตำแหน่ง โดยใช้ sprintf) คั่นด้วยช่องว่าง

ตัวอย่างข้อมูลเข้า/ข้อมูลออก 1
Peter
12500.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
10000.00
Peter 168000.00
ตัวอย่างข้อมูลเข้า/ข้อมูลออก 2
Wisdom
13090.00
2112.00
14325.00
8712.00
6344.00
11437.00
12312.50
9488.25
21000.00
16290.00
15800.00
10033.00
8547.00
Wisdom 177540.11

[hide line #]
#include <iostream>
#include <string>
#include <cstdio>
using namespace std;

int main(){
    char name[10000];
    double salary ,value,total;
    cin >> name;
    cin >> salary;
    for (int i=0;i<12;i++){
        cin >> value;
        total += salary+value*0.15;
        
    }
    char output[100] ;
    sprintf(output,"%s %.2f",name,total);
    cout << output;

}
