[C++]

ณ เรือนจำแห่งหนึ่ง มีการระบุตัวนักโทษ โดยใช้หมายเลขจำนวนเต็มบวกแทนชื่อของนักโทษ เริ่มตั้งแต่หมายเลข 1, 2, 3, ..., n หมายเลขจะแปะอยู่ที่เสื้อของนักโทษ

ทุกเช้าจะมีการเช็คชื่อ โดยใช้กล้องสแกนหมายเลขบนเสื้อของนักโทษ ให้นิสิตหาว่านักโทษหมายเลขใดหายไปจากการเช็คชื่อในเช้าวันนี้บ้าง

ข้อมูลเข้า
บรรทัดแรก เป็นจำนวนของนักโทษ ที่กล้องสามารถสแกนหมายเลขบนเสื้อได้
บรรทัดต่อมา เป็นหมายเลขที่กล้องสามารถสแกนได้ คั่นแต่ละหมายเลขด้วยช่องว่าง โดยนักโทษหมายเลข n จะถูกสแกนได้เสมอ
ข้อมูลออก
บรรทัดแรก แสดงหมายเลขของนักโทษที่หายไป เฉพาะหมายเลขคี่ เรียงตามลำดับจากน้อยไปมาก คั่นด้วยช่องว่าง
บรรทัดที่สอง แสดงหมายเลขของนักโทษที่หายไป เฉพาะหมายเลขคู่ เรียงตามลำดับจากน้อยไปมาก คั่นด้วยช่องว่าง
ตัวอย่างข้อมูลเข้า/ข้อมูลออก
15
7 1 4 18 9 3 8 2 5 14 20 19 12 11 13
15 17 
6 10 16

[hide line #]
#include <iostream>
using namespace std;

int main() {
    int n ;
    cin >> n;

    //input
    int nums[n];  
    for (int i = 0; i < n; i++){
        scanf("%d", &nums[i]);
    }

    //max
    int max = 0;
    for (int i = 0; i < n; i++){
        if(nums[i]>max)
            max = nums[i];
    }

    //miss array
    int misses[max-n];
    int j=0;
    for (int num = 1; num <= max; num++){
        for (int i = 0; i < n ; i++){
            if(num==nums[i])
                break;
            if(i==n-1)
                misses[j++] = num;
        }
    }
    
    //sort
    for (int i = 0; i < max-n; i++){
        for (int j = 0; j < max-n; j++){
            if (misses[i]<misses[j]){
                int tmp = misses[i];
                misses[i] = misses[j];
                misses[j] = tmp;
            }
        }
    }

    //odd
    for (int i = 0; i < max-n; i++){
        if(misses[i]%2 != 0)
            cout << misses[i] << " ";
    }
    
    cout << endl ;

    //even
    for (int i = 0; i < max-n; i++){
        if(misses[i]%2 == 0)
            cout << misses[i] << " ";
    }


}
