Submitted on 3:54 13 Jan 2024 || Result: PASSED [PPPPPPPPPPPPPPP] Explain results
คู่สามของพิธากอรัส
สามเหลี่ยมมุมฉากที่มีด้านประกอบมุมฉากยาว a และ b และมีด้านตรงข้ามมุมฉากยาว c จะมีความสัมพันธ์ตามทฤษฎีของพิธากอรัสคือ \( a^2 + b^2 = c^2 \) คู่สามของพิธากอรัสก็คือค่า ( a, b, c ) นี่เอง จงเขียนโปรแกรมรับค่า n และตรวจสอบดูว่ามีคู่สามของพิธากอรัสใดที่ n = a+b+c หรือไม่ กำหนดให้ n, a, b, และ c เป็นเลขจำนวนเต็มเท่านั้น และ a < b < c

ตัวอย่างเช่นเมื่อ n = 12 คู่สามของพิธากอรัสก็คือ (3, 4, 5) หรือเมื่อ n = 30 คู่สามของพิธากอรัสก็จะเป็น (5, 12, 13) เป็นต้น ถ้าค่า n นั้นไม่สามารถหาคู่สามของพิธากอรัสได้ให้พิมพ์คำว่า No triple found.

หมายเหตุ: ค่า n หนึ่งค่าอาจมีคู่สามของพิธากอรัสมากกว่าหนึ่งชุด แต่ในการตรวจนั้นจะใช้เฉพาะค่า n ซึ่งทำให้มีคู่สามของพิธากอรัสอย่างมากที่สุดแค่คู่เดียว จึงไม่ต้องกังวลในประเด็นนี้ในการทำโจทย์ข้อนี้นี้

ตัวอย่างผลลัพธ์ 1
12
(3, 4, 5)
ตัวอย่างผลลัพธ์ 2
20
No triple found.

[hide line #]
#include <stdio.h>

int main() {
    int n;

    scanf("%d", &n);

    int found = 0;  


    for (int a = 1; a < n; ++a) {
        for (int b = a + 1; b < n; ++b) {
            int c = n - a - b;  


            if (a * a + b * b == c * c) {
                printf("(%d, %d, %d)\n", a, b, c);
                found = 1;
            }
        }
    }

    if (!found) {
        printf("No triple found.\n");
    }


}

