Submitted on 3:50 18 Dec 2023 || Result: PASSED [PPPPPPPP] Explain results
จงเขียนโปรแกรมภาษาซี ซึ่งรับข้อมูลจำนวนจริง salary แสดงถึงรายได้ต่อปีของบุคคล

โปรแกรมนี้จะคำนวณว่า จากรายได้ต่อปีของบุคคลนั้น จะต้องจ่ายภาษีเป็นจำนวนเท่าใด (ให้แสดงเป็นทศนิยม 2 ตำแหน่ง)
โดยการเก็บภาษีจะเป็นแบบขั้นบันได กล่าวคือ 300,000 บาทแรกจะต้องจ่าย 5% และ 300,000.01 บาทขึ้นไปจะจ่าย 10%

เช่น ถ้ารายได้ต่อปีเป็น 100,000 บาท จะจ่ายภาษี 5% เท่ากับ 5,000 บาท

แต่ถ้ารายได้ต่อปีเป็น 500,000 บาทแล้ว การจ่ายภาษีจะคำนวณดังนี้
300,000 บาทแรกจะจ่าย 5% เท่ากับ 15,000 บาท และที่เหลือ 200,000 บาทจะจ่าย 10% เท่ากับ 20,000 บาท ดังนั้น เสียภาษีรวมเป็นเงิน (15,000+20,000=35,000 บาท)

นอกจากนั้น ถ้ารายได้เป็นค่าลบ ให้แสดงข้อความเตือน Error: Salary must be greater or equal to 0

ตัวอย่างการทำงาน 1

100000.00
5000.00
ตัวอย่างการทำงาน 2

500000
35000.00
ตัวอย่างการทำงาน 3

-100
Error: Salary must be greater or equal to 0

[hide line #]
#include <stdio.h>
#include <stdlib.h>

int main(){
    char salary_str[50];
    double salary, tax;
    fgets(salary_str,50,stdin);
    salary = atof(salary_str);

    if (salary < 0){
        printf("Error: Salary must be greater or equal to 0");
    } else if (salary <= 300000){
        tax = salary*5/100.0;
        printf("%.2lf",tax);
    } else if (salary > 300000){
        tax = 15000+((salary-300000)*10/100.0);
        printf("%.2lf",tax);
    }
}
